app/controllers/authentications_controller.rb

  def register
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "john@yorkey1.com"], ["password_digest", "$2a$10$IQsBt9cTZuTIpEcCFkRCieceJgIjtJXyVgj1QH3M3IQtQ2XLunqLS"], ["created_at", 2017-02-16 12:39:50 UTC], ["updated_at", 2017-02-16 12:39:50 UTC]]