app/controllers/jobs_controller.rb

SELECT "requests".* FROM "requests" WHERE (user_id = 5)
---
  def index
    @requests = Request.where("user_id = #{@current_user.id}")

SELECT  "requests".* FROM "requests" WHERE (user_id = 4) ORDER BY "requests"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def applied
    @request = Request.where("user_id = #{@current_user.id}")