app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests" WHERE "requests"."job_id" = $1 AND "requests"."status" = $2  [["job_id", 1], ["status", 1]]
---
  def jobApplications
    @requests = Request.where(job_id: params[:id], status: 1);

INSERT INTO "requests" ("message", "job_id", "user_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["message", "I would love to do this!"], ["job_id", 2], ["user_id", 4], ["created_at", 2017-02-21 19:09:29 UTC], ["updated_at", 2017-02-21 19:09:29 UTC], ["status", 1]]
---
  def create
    @request = Request.new(request_params)
    @request.user_id = @current_user.id
    @request.status = 1
    if @request.save

UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", 2], ["updated_at", 2017-02-22 02:25:27 UTC], ["id", 1]]
---
  def update
    if @request.update(request_params)

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_request
      @request = Request.find(params[:id])