app/controllers/reviews_controller.rb

  def index
    @reviews = Review.where({user_id: params[:id]});
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" IS NULL

  def userReviews
    @reviews = Review.where({user_id: params[:id]});
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 9]]

  def create
    @review = Review.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("message", "user_id", "job_id", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["message", "Awesome work"], ["user_id", 9], ["job_id", 4], ["rating", 3.0], ["created_at", 2017-02-22 18:51:12 UTC], ["updated_at", 2017-02-22 18:51:12 UTC]]