app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "Tommy"], ["updated_at", 2017-02-21 16:13:21 UTC], ["id", 9]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1  [["user_id", 8]]
DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 14]]
---
  def destroy
    @jobs = Job.where({ owner_id: @current_user.id })
    @jobs.destroy_all
    @requests = Request.where({ user_id: @current_user.id })
    @requests.destroy_all